app/controllers/tweets_controller.rb

  def index
    @new_tweets = Tweet.where(:user_id => current_user.id).reverse
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 32]]

  def create

      check = params[:autoretweet]
      if check.nil?

  	    @tweet = Tweet.new(twitter_params)
  	    @tweet.user_id = current_user.id
  	    @tweet.save
  	#    redirect_to root_path
      else
        @tweet = Tweet.new(twitter_params)
        @tweet.user_id = current_user.id
        puts params.inspect
        @tweet.save
        last_id = Tweet.maximum('retweetid')
        @role = User.where(:company_id => current_user.company_id, :role => "user")
        @role.each do |t|
          @tweet_user = TweetsUser.new
          @tweet_user.user_id = t.id
          @tweet_user.tweet_id = last_id
          @tweet_user.save
---
INSERT INTO "tweets" ("user_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["message", "hi"], ["created_at", 2016-12-07 12:58:31 UTC], ["updated_at", 2016-12-07 12:58:31 UTC]]
SELECT MAX("tweets"."retweetid") FROM "tweets"
SELECT "users".* FROM "users" WHERE "users"."company_id" = ? AND "users"."role" = ?  [["company_id", 111], ["role", "user"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "tweets_users" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 31], ["user_id", 31], ["created_at", 2016-12-19 08:55:54 UTC], ["updated_at", 2016-12-19 08:55:54 UTC]]